Repository: mozilla-l10n/mt-training-data
Catalog: ps/ps_pontoon.tmx
Source language: en_us
Languages: ps

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
ps: تاسو کولی شئ مستقیم URLs په خپل غوره ډاونلوډ مدیر کې کاپي او پیسټ کړئ. دوی به په 12 ساعتونو کې پای ته ورسیږي، مګر تاسو کولی شئ دې پاڼې ته بیرته راشئ ترڅو هر وخت نوي جوړ کړئ.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
ps: تاسو کولی شئ د کیبورډ شارټ کټ هم وکاروئ: { sc-review-form-button-approve-shortcut } د تصویب لپاره، { sc-review-form-button-reject-shortcut } د رد کولو لپاره، { sc-review-form-button-skip-shortcut } د پریښودو لپاره

source: You can choose to make your username public or anonymous.
ps: تاسو کولی شئ خپل کارن نوم عام یا ګمنام کړئ.

source: You can find <examplePromptsLink>120 example prompts in this sheet.</examplePromptsLink>
ps: تاسو کولی شئ په دې پاڼه کې د <examplePromptsLink>۱۲۰ مثال لارښوونې ومومئ.</examplePromptsLink>

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
ps: تاسو کولی شئ <datasetsPag>ډاټاسیټونه پاڼې</datasetsPage> ته لاړ شئ، هغه نسخه او ژبه غوره کړئ چې تاسو یې غواړئ، او ډاونلوډ یې کړئ! فایلونه <metadataLink> تړلي میټاډاټا</metadataLink> لري، لکه د ډیموګرافیک معلومات او د اعتبار ډاټا. تاسو به د ډیټاسیټ ډاونلوډ کولو لپاره د بریښنالیک پته چمتو کولو ته اړتیا ولرئ.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
ps: تاسو کولی شئ د عام غږ پېژنیال په جوړولو او خپل غږ مرسته کولو له لارې د یوه متنوع، آزاد کوډ ډېټاسیټ جوړولو کې مرسته وکړئ.

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
ps: تاسو کولی شئ د موزیلا ژبو ټولنو کې د موضوعي خبرو اترو لپاره د <discourseLink>Discourse</discourseLink> سره یوځای کیدو سره، یا د چټک مشورې لپاره <matrixLink>Matrix</matrixLink> سره لیدنه وکړئ.

source: You cannot add multiple sentences for a single submission
ps: تاسو نشئ کولی د یوې سپارښتنې لپاره د يوې نه ډیرې جملې اضافه کړئ

source: You cannot request your recordings while another request is already in progress.
ps: تاسو نشئ کولی د خپلو ریکارډونو غوښتنه وکړئ پداسې حال کې چې بله غوښتنه لا دمخه روانه وي.

source: You can request a new takeout of your recordings every { $days } days.
ps: تاسو کولی شئ په هر { $days } ورځو کې د خپلو ریکارډونو نوي اخیستلو غوښتنه وکړئ.

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
ps: تاسو پیښې ترسره کولی شئ ترڅو خلک د سره مرسته وکړي. دا ستاسو د فکر په پرتله اسانه ده. تاسو دا د ویډیو کنفرانس کولو وسیلې سره آنلاین ترسره کولی شئ ، یا په شخصي توګه که دا خوندي وي. <eventTemplate>د پیښو د چلولو لپاره زموږ ټیمپلیټونه او سرچینې وګورئ</eventTemplate>.

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
ps: تاسو کولی شئ <sentenceCollectorLinkAdd> لږ شمیر جملې اضافه کړئ</sentenceCollectorLinkAdd>، یا تاسو کولی شئ <bulkImportDocsLink>د Github</bulkImportDocsLink> په کارولو سره ډیری واردات ترسره کړئ. په یاد ولرئ چې جملې باید <licenseLink>CC0 (یا عامه ډومین)</licenseLink> وي، یا تاسو کولی شئ خپل ځان ولیکئ.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
ps: تاسو کولی شئ د ویکیپیډیا څخه د لنډو جملو د ګټې اخیستنې لپاره <scraperLink>Sentence Extractor</scraperLink> وکاروئ.

source: You check whether the transcription matches the audio
ps: تاسو ګورئ چې ایا نقل له آډیو سره سمون لري که نه.

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
ps: تاسو کولی شئ ویب پاڼه شامله کړئ، د مثال په توګه "عام غږ - https://commonvoice.mozilla.org/"

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
ps: تاسو کولی شئ د اکاډمیک حواله کولو سټایل وکاروئ ، د مثال په توګه د هارورډ سټایل "موزیلا (2021) عام غږ. په https://commonvoice.mozilla.org/ کې شتون لري (لاسرسی: 15 سپتمبر 2021)"

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
ps: تاسو کولی شئ د پیغام ترلاسه کولو لپاره د ټولنیزو رسنیو پلیټ فارمونه وکاروئ. پوسټونه شریک کړئ چې تشریح کړي چې ولې دا مهم دي، او د نورو خلکو سره اړیکه ونیسئ لکه د ژبې حقونه، غږ AI، یا په ټیکنالوژۍ کې تعصب. د <compaignLink> د ټولنیز کمپاین د چلولو په اړه نور مشورې وګورئ، په شمول هغه مواد چې تاسو یې بیا کارولی شئ</campaignLink>.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
ps: تاسو کومه ژبه نه ده غوره کړې. مهرباني وکړئ د ژبې غوره کولو لپاره خپل <profileLink>Profile</profileLink> ته لاړ شئ.

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
ps: تاسو د دې پاڼې لپاره د سپارلو حد ته رسیدلی یاست. مهرباني وکړئ د بلې جملې وړاندې کولو دمخه { $retryLimit } دقیقو انتظار وکړئ. ستاسو د صبر لپاره مننه!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
ps: تاسو د دې پاڼې د سپارلو حد ته رسیدلي یاست. مهرباني وکړئ د بلې جملې د سپارلو دمخه د { $retryLimit } ثانیو لپاره انتظار وکړئ. ستاسو د صبر لپاره مننه!

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
ps: تاسو په دې پاڼه کې ناخوندي سمونې لری. که چېرې تاسو ځای بدل کړئ، ستاسو بدلونونه به خوندي نشي. ايا تاسو ډاډه ياست چې ځای بدل کړئ؟

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
ps: تاسو په دې پاڼه کې ناخوندي شوي بدلونونه لرئ. که چېرې تاسو دا مخ پرېږدئ، ستاسو سمونې به خوندي نشي. ايا تاسو ډاډه ياست چې دا مخ پرېږدئ؟

source: You have unsaved changes on this page. If you switch datasets, your changes will not be saved. Are you sure you want to switch?
ps: تاسو په دې پاڼه کې ځینې بدلونونه لا نه دي ثبت کړي. که ډیټا سیټ بدل کړئ، دا بدلونونه به له منځه ولاړ شي. ایا ډاډه یاست چې بدل یې کړئ؟

source: You might also want to consider spanning different contexts and domains.
ps: تاسو ممکن د مختلفو شرایطو او ساحو پراخولو په اړه هم فکر وکړئ.

source: You might have reached here by clicking a link in a social media app. You are using an in-app browser which does not support audio recording.
ps: تاسو ممکن دلته د ټولنیزو رسنیو اپلیکیشن کې د لینک په کلیک کولو سره رسیدلي یاست. تاسو د اپلیکیشن دننه براوزر کاروئ چې د آډیو ثبتولو ملاتړ نه کوي.

source: You must allow microphone access.
ps: تاسو باید د مایکروفون لاسرسي ته اجازه ورکړئ.

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
ps: تاسو اړتیا لرئ د ثبت کولو هره کلمه واورئ. موږ غواړو د ماشین زده کړې الګوریتمونه د دې وړتیا ولري چې د مختلف شالید شور اداره کړي ، او حتی نسبتا لوړ غږونه یا خاموش شالید میوزیک ومنل شي پدې شرط چې دوی تاسو د متن بشپړ اوریدلو مخه ونه نیسي. کریکونه یا 'ماتیدل' چې تاسو د متن اوریدلو مخه نیسي پدې معنی چې تاسو باید کلیپ رد کړئ.

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
ps: ستاسو خجنښه ستاسو د کلمو تلفظولو طریقه ده. دا د هغه ځای چیرته چې تاسو ژوند کړی، په نورو کومو ژبو خبرې کوئ او ډیری نور عواملو له مخې کیدای شي بڼه واخلي. تاسو کولی شئ هر هغه معلومات شریک کړئ چې تاسو یې احساس کوئ دلته اړین دي.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
ps: ستاسو ناپېژانده غږیز ثبتونه به د عام غږ په ډېټاسیټ کې پاتې شي. یوځل چې تاسو خپل پېژنیال ړنګ کړئ نو تاسو به نور د دې وړتیا ونلرئ چې د ډېټاسیټ څخه خپل د ثبت لیرې کولو غوښتنه وسپارئ

source: Your daily goal has been created
ps: ستاسو ورځنۍ موخه رامینځته شوی

source: Your dataset is downloading!
ps: ستاسو ډیټاسیټ ډاونلوډ کیږي!

source: Your download has started.
ps: ستاسو راکښته‌کول پیل شوي دي.

source: You’re contributing to a target segment
ps: تاسو یوې په نښه شوي برخې کې ونډه اخلئ

source: You’re contributing to our first target segment
ps: تاسو زموږ په لومړۍ هدفي برخې کې ونډه اخلئ

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ps: تاسو دا مهال بریښنالیکونه لکه د موخې یادونه، زما د پرمخ تګ په اړه تازه مالومات او د ګډ غږ په اړه خبرلیکونه <bold> نه </bold> ترلاسه کوئ

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ps: تاسو دا مهال د برېښنالیکونو لکه د موخې یادونه، زما د پرمختګ په اړه تازه مالومات او د ګډ غږ په اړه خبرلیکونو ترلاسه کولو لپاره ټاکل شوي یاست

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
ps: تاسو ډیر چټک روان یاست. مهرباني وکړئ د جملې بیاکتنې لپاره یو څه وخت ونیسئ ترڅو ډاډ ترلاسه کړئ چې دا سمه ده.

source: You're helping Common Voice reach our daily sentence goals!
ps: تاسو د عام غږ سره زموږ د ورځني جملې اهدافو ته رسیدو کې مرسته کوئ!

source: Your email address
ps: ستاسو بریښنالیک آدرس

source: You respond or reply to it as naturally as you can
ps: تاسو ورته څومره چې کولای شئ په طبیعي ډول <mark>ځواب</mark> ورکړئ.

source: Your files are being assembled. Please check again later.
ps: ستاسو فایلونه راټولیږي. مهرباني وکړئ وروسته بیا وګورئ.

source: Your Languages
ps: ستاسو ژبې

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
ps: ستاسو د ژبې توپیر ممکن د جملو څخه بهر وي! که تاسو آرام یاست، تاسو کولی شئ خپل ترتیبات بدل کړئ ترڅو په خپله ژبه کې نورې جملې وګورئ.

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
ps: ستاسو د ژبې توپیر ممکن د جملو څخه بهر وي! که تاسو آرام یاست، تاسو کولی شئ خپل ترتیبات بدل کړئ ترڅو په خپله ژبه کې نورې جملې وګورئ.

source: Your username and email will not be associated with the published data.
ps: ستاسو کارن نوم او برېښنالیک به د خپاره شوي مالوماتو سره تړاو ونلري.

source: Your weekly goal has been created
ps: ستاسو اونېزه موخه رامینځته شوی

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
ps: تاسو باید په لنډه توګه یو بریښنالیک ترلاسه کړئ چې په عام غږ کې ستاسو د ژبې اضافه کولو ګامونه تشریح کوي

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
ps: تاسو زموږ د ورځني{ $goalValue } ثبتولو موخې څخه د عام غږ <goalPercentage></goalPercentage> ته رسولو کې مرسته کړې!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
ps: تاسو زموږ د ورځني { $goalValue } تاییدولو موخې څخه د عام غږ <goalPercentage></goalPercentage> ته رسولو کې مرسته کړې!

source: You've successfully signed up for contributing to { $language }. Thank you.
ps: تاسو په بریالیتوب سره د { $language } سره د مرستې لپاره نوملیکنه کړې. مننه.

source: You want to join the Common Voice mailing list
ps: زه غواړم د عام غږ بریښنالیک لیست کې شامل شم

source: You write down what you hear in the audio clips
ps: تاسو هغه څه ولیکئ چې تاسو یې په آډیو کلیپونو کې اورئ

source: Zaza
ps: ززا

source: Zip #{ $offset } of { $total }
ps: زپ #{ $offset } د { $total } څخه

source: Zulu
ps: زولو

source: abnormality
ps: بې‌نورمالي

source: account recovery key
ps: د ګڼون بیاموندلو کیلي

source: add-on
ps: پر-زیاتوونی

source: aggregate
ps: ټولټال

source: All Hands
ps: ټول لاسونه

source: alternate text
ps: متبادل متن

source: appear
ps: څرګندیدل

source: appearance
ps: څیره

source: attack
ps: برید

source: attacker
ps: بریدګر

source: Attack Site
ps: د برید ځای

source: attendee
ps: ګډونوال

source: authenticate
ps: تصدیق کول

source: authenticated
ps: تصدیق شوی

source: authentication code
ps: د تصدیق کوډ

source: autoplay
ps: خپلسري پلي کول

source: back out
ps: شاتګ

source: backup authentication code
ps: د بیک اپ تصدیق کوډ

source: black box
ps: تور بکس

source: bookmark
ps: ليکى-نښول

source: boolean
ps: بولین

source: boot
ps: ایسته کول

source: breakpoint
ps: ماتي ټکی

source: Bug report
ps: د بګ راپور

source: certificate authority
ps: د باورلیک مقام

source: channel
ps: چینل

source: cipher
ps: سایپر

source: clipboard
ps: کليپ تخته

source: clockwise
ps: د ساعت په لوری

source: colorway
ps: رنګ‌لار

source: compact
ps: وړوکی

source: compact - recommend deprioritize
ps: وړوکی - د نالومړیتوب سپارښتنه

source: confirmation code
ps: دتائید کوډ

source: context
ps: تړاو

source: contribute
ps: مرسته کول

source: cookie banner
ps: کوکي بینر

source: corrupt
ps: فاسد

source: corrupted
ps: فاسد

source: counterclockwise
ps: د ساعت مقابل لوری

source: crash
ps: ټکر

source: cross-site tracking cookie
ps: د کراس سایټ تعقیب کوکي

source: cryptominer
ps: ګوډکېندونکی

source: cryptomining
ps: ګوډکېندنه

source: debug
ps: کړاوتمبونه

source: deceptive site
ps: غولونکی سایټ

source: decode
ps: کوډ پرانېستل

source: decryption
ps: کوډه پرانېستنه

source: disinformation
ps: ناسم مالومات

source: distrust
ps: بې باوره کیدل

source: eavesdropping
ps: غوږ نېول

source: email mask
ps: د بریښنالیک ماسک

source: enable
ps: چارنول

source: encode
ps: کوډول

source: encrypt
ps: کوډول

source: encryption
ps: کوډ کښنه

source: end user
ps: وروستی کارن

source: Enhanced Tracking Protection
ps: د پرمختللي څار خوندیتوب

source: executable file
ps: عملي کېدونکې دوتنه

source: extension
ps: شاتاړى

source: external
ps: باندنۍ

source: Fellow
ps: کارپوه

source: filter bubble
ps: چاڼ شوی پوکاڼه

source: fingerprinter
ps: ګوت نښې ټولوونکی

source: fingerprinting
ps: د ګوت نښې ټولوونه

source: Firefox View
ps: د فایرفاکس لید

source: gear
ps: توکي

source: grassroots
ps: بنسټیز غورځنګ

source: home page
ps: کور پاڼه

source: idle
ps: بیکاره

source: import
ps: واردول

source: independent browser
ps: خپلواک براوزر

source: innovations
ps: نوښتونه

source: insecure
ps: ناخوندي

source: installation
ps: لګاو

source: Issue
ps: ستونزه

source: Legacy extension
ps: میراثي شاتاړی

source: misinformation
ps: ناسم مالومات

source: native
ps: سېمه‌يیز

source: net neutrality
ps: د انټرنیټ ناپېيلتوب

source: nonprofit
ps: ناګټندوی

source: non-profit
ps: ناګټندوی

source: open source
ps: پرانېستې سرچينه

source: override
ps: مخنیوی کول

source: participation
ps: ګډون

source: Patch
ps: پېنه

source: phone number mask
ps: د تلیفون شمېرې ماسک

source: pop-up
ps: ښکاره کېدل

source: preference
ps: غوره‌توب

source: Privacy Notice
ps: د پټنتيا خبرتيا

source: release
ps: خوشې کول

source: report
ps: راپور

source: restricted site
ps: محدود سایټ

source: revert
ps: بېرته ګرځول

source: Review checker
ps: د بیاکتنې سم‌کتونکی

source: search suggestion
ps: د لټون وړانديز

source: security keys
ps: خونديتوب کونجيانې

source: sensitive
ps: حساس

source: sidebar
ps: څنگپټه

source: sign
ps: نښه

source: signer
ps: لاسلیکوونکی

source: sign in
ps: ننوتون

source: sign-in
ps: ننوتون

source: studies
ps: څېړنې

source: Terms of Service
ps: د چوپړ شرطونه

source: track
ps: پلنيوى

source: trackers
ps: پلنيوونکي

source: Tracking Content
ps: د پلنیونې منځپانگه

source: Turbo Mode
ps: ټربو اکر

source: unencrypted
ps: ناکوډول شوی

source: unresponsive
ps: بې ځوابه

source: unsafe
ps: ناخوندي

source: validate
ps: تصدیق کړئ

source: validity
ps: اعتبار

source: version
ps: بل‌بڼه

source: Web Authentication
ps: وېب تصديق

source: Congratulations, you have translated your first "string"!
ps: ښه راغلاست، تاسو خپل لومړی "ترتیب" ژباړلی دی!

source: Welcome to Pontoon! Translate this sentence and press Enter.
ps: پونټون ته ښه راغلاست! دا جمله وژباړئ او Enter فشار ورکړئ.
